# SpatialFieldMgrLegendShowDescription Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpatialFieldMgrLegendShowDescription Property
ParameterTypeId Class See Also
---
"Show Description"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpatialFieldMgrLegendShowDescription { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpatialFieldMgrLegendShowDescription As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpatialFieldMgrLegendShowDescription {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace